import privacy from './UTPV.module.css';

function Privacy() {

    return (

        <>
            <div className={privacy.allutpv}>
                <p>개인정보처리방침 PRIVACY</p>
                <hr></hr>
                <p>개인정보보호법에 따라 개인정보의 항목, 개인정보의 수집 및 이용 목적, 개인 정보의 보유 및 이용 기간, 동의 거부권 및 동의 거부 시 불이익에
                    관한 사항을 안내 드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.
                </p>
                <p>
                    1. 개인정보의 수집 및 이용 목적<br />
                    ① 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금 정산<br />
                    - 콘텐츠 제공, 물품 배송 또는 청구서 등 발송, 금융거래 본인 인증 및 금융 서비스, 구매 및 요금 결제, 요금 추심<br />
                    ② 회원 관리<br />
                    - 회원제 서비스 이용에 따른 본인 확인, 개인 식별, 불량 회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 가입 및 가입 횟수 제한,
                    불만 처리 등 민원 처리, 고지 사항 전달
                </p>
                <p>
                    2. 수집하는 개인정보 항목/<br />
                    ① 최초 회원 가입 시 회원 식별 및 최적화된 서비스 제공을 위해 아래와 같은 정보를 수집합니다./<br />
                    - 이름, 아이디, 닉네임, 비밀번호, e-mail, 연락처, 주소, 생년월일, 성별, 직업/<br />
                    ② 서비스 이용 과정이나 사업 처리 과정에서 아래와 같은 정보들이 생성되어 수집 될 수 있습니다./<br />
                    - 쿠키, 서비스 이용 기록(로그인 일시, IP주소, 부정 이용 등), 결제 기록, 위치 정보, 기기 정보(기기고유식별자 및 OS 버전)
                </p>
                <p>
                    3. 개인정보의 보유 및 이용 기간/<br />
                    원칙적으로 개인정보 수집 및 이용 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다./<br />
                    단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다./<br />
                    ① 회원 탈퇴 시 보존 개인정보/<br />
                    - 보존 항목: 회원님께서 제공한 이름, 아이디, 이메일 주소, 주소, 전화번호/<br />
                    - 보존 근거: 불량 이용자의 재가입 방지, 명예훼손 등 권리 침해 분쟁 및 수사 협조/<br />
                    - 보존 기간: 회원 탈퇴 후 1년간/<br />
                    ② 상거래 관련 보존 개인정보/<br />
                    전자상거래 등에서의 소비자 보호에 관한 법률, 전자문서 및 전자거래 기본법, 통신비밀보호법 등 법령에서 일정 기간 정보의 보관을 규정하는 경우는
                    아래와 같습니다. 픽스타는 이 기간 동안 법령의 규정에 따라 개인정보를 보관하며, 본 정보를 다른 목적으로는 절대 이용하지 않습니다./<br />
                    - 보존 항목: 상거래 이력/<br />
                    - 보존 근거: 상법, 전자상거래 등에서의 소비자보호에 관한 법률/<br />
                    - 보존 기간: 계약 또는 청약철회 등에 관한 기록 : 5년 보관/<br />
                    - 대금 결제 및 재화 등의 공급에 관한 기록 : 5년 보관/<br />
                    - 소비자의 불만 또는 분쟁 처리에 관한 기록 : 3년 보관/<br />
                </p>
                <p>
                    4. 개인정보 수집 및 이용 동의를 거부할 권리/<br />
                    이용자는 개인정보의 수집 및 이용 동의를 거부할 권리가 있습니다. 회원 가입 시 수집하는 최소한의 개인정보, 즉, 필수 항목에 대한 수집 및 이용 동의를
                    거부하실 경우, 회원 가입이 어려울 수 있습니다.
                </p>
                <p>
                    5. 자동 수집 장치의 설치, 운용 및 그 거부에 관한 사항/<br />
                    회사는 회원에게 개인화되고 맞춤화된 서비스를 제공하기 위해 이용자의 정보를 저장하고 수시로 불러오는 쿠키(cookie)를 사용합니다./<br />
                    - 쿠키의 사용 목적/<br />
                    회원과 비회원의 접속 빈도나 방문 시간 등의 분석, 이용자의 취향과 관심 분야의 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한
                    타겟 마케팅 및 개인 맞춤 서비스 제공/<br />
                    - 쿠키 설정 거부 방법/<br />
                    이용자는 쿠키 설치에 대해 거부할 수 있습니다. 단, 쿠키 설치를 거부하였을 경우 로그인이 필요한 일부 서비스의 이용이 어려울 수 있습니다./<br />
                    - 설정 방법(IE 기준): 웹 브라우저 상단의 도구 → 인터넷 옵션 → 개인정보 → 사이트 차단
                </p>
                <p>
                    6. 개인정보 보호 책임자 및 담당 부서/<br />
                    성명: 윤수빈/<br />
                    직책: 사원/<br />
                    전화번호: 02-000-0000/<br />
                    이메일: pixelpower@pix.co.kr/<br />
                    담당부서: 고객서비스팀
                </p>
                <hr></hr>
            </div>
        </>
    );

}

export default Privacy;