import useterms from './UTPV.module.css';

function UseTerms() {

    return (

        <>
            <div className={useterms.allutpv}>

                <p>이용약관 TERMS</p>
                <hr></hr>
                <p>◈ 제 1 장 ◈</p>
                <p>총 칙</p>

                <p>제 1조 (목적)
                    본 약관은 픽셀파워(주)에서 운영하는 맛집 평가 전문 픽스타 사이트에서 제공하는 인터넷 관련 서비스
                    (이하 "서비스"라 한다)의 이용 조건 및 절차에 관한 사항을 규정함을 목적으로 합니다.</p>

                    <p>제 2조
                    2.1 본 약관은 서비스 화면에 게시하거나 그 외의 방법으로 이용자에게 공시함으로써 효력을 발생합니다.
                    2.2 회사는 영업상 중요한 사유가 있을 때 약관을 변경할 수 있으며, 변경된 약관은 전 항과 같은 방법으로 효력을 발생합니다.</p>

                    <p> 제 3조 (정의)
                    "회원"이란 픽스타 회원으로 적합하다고 인정하는 개인으로서 본 약관에 동의하고 회원 가입 양식을 작성하고 아이디와 비밀번호를 발급 받은 자를 말합니다.</p>

                    <p>제 4조 (약관의 공지 및 준용)
                    4.1 회사는 약관의규제에관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에관한법률, 방문판매등에관한법률, 소비자보호법 등 관련법을 위배하지
                    않는 범위에서 이 약관을 개정할 수 있습니다.
                    4.2 회사는 약관을 개정할 경우에는 적용 일자 및 개정 사유를 명시하여 현행 약관과 함께 초기 화면에 그 적용 일자 7일 이전부터 적용 일자 전일까지 공지합니다.
                    단, 회원의 연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우 공지를 개별 통지로 간주합니다.
                    4.3 회원은 변경된 약관이 공지된 후 15일 이내에 거부의사를 표명할 수 있습니다. 회원이 거부하는 경우 회사는 당해 회원과의 계약을 해지(회원탈퇴)할 수 있습니다.
                    만약 회원이 변경된 약관이 공지된 후 15일 이내에 회원 탈퇴를 하지 않는 경우에는 개정 약관에 동의하는 것으로 간주합니다.</p>

                    <p>제 5조 (서비스의 변경)
                    5.1 회사는 불가피한 여건이나 사정이 있는 경우 서비스의 내용을 변경하거나 중단할 수 있습니다.
                    5.2 회사는 1항의 사유로 서비스 내용이 변경 또는 중단되는 경우, 이로 인하여 회원 또는 제 3자가 입은 손해에 대하여는 배상하지 아니합니다.</p>

                    <p>제 6조 (약관 외 준칙)
                    본 약관에 명시되지 않은 사항은 전자거래기본법, 전자서명법, 통신판매법 및 기타 관련 법령의 규정에 의합니다.</p>

                    <p>◈ 제 2 장◈</p>

                    <p>회원가입계약</p>

                    <p>제 7조 (이용 계약의 성립)
                    7.1 이용계약은 회원이 되고자 하는 자(이하 “가입신청자”)가 약관의 내용에 동의를 하고, 회사가 정한 가입 양식에 따라 회원정보를 기입하여
                    회원가입신청을 하고 회사가 이러한 신청에 대하여 승인함으로써 체결됩니다.
                    7.2 회사는 다음 각 호에 해당하는 신청에 대하여는 승인하지 않거나 사후에 이용계약을 해지할 수 있습니다.
                    7.2.1가입신청서의 내용을 허위로 기재하거나 기재누락∙오기가 있는 경우
                    7.2.2다른 사람의 명의, E-mail, 연락처 등을 이용한 경우
                    7.2.3관계법령에 위배되거나 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우
                    7.2.4가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단 회사의 사전재가입 승낙을 얻은 경우에는 예외로 함
                    7.2.5회원의 귀책사유로 인하여 승인이 불가능한 경우
                    7.2.6이미 가입된 회원과 전화번호나 E-mail 정보가 동일한 경우
                    7.2.7부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우
                    7.2.8타 본 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우 및 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우
                    7.2.9 14세 미만의 아동이 신청할 경우
                    7.2.10계약의 성립 시기는 회사가 ‘가입완료’ 사실을 신청절차 상에 표시하거나 별도로 통지한 시점으로 합니다.</p>
                    <p>제 8조 (회원 가입)
                    8.1 픽스타의 일반 회원 가입은 무료이며, 가입과 동시에 메뉴에 접속이 가능합니다.
                    8.2 픽스타에 신규 가입을 희망하는 이용자는 소정의 회원 가입 신청서를 반드시 작성하여야 하며, 가입을 희망하시는 분이 당사의 회원으로
                    적합하지 않다고 인정될 경우, 당사는 입회 신청을 거절할 수 있고 이 경우 부적격 사유를 개별적으로 통보해 드립니다.
                    8.3 회원은 등록 사항에 변경이 있는 경우, 즉시 본인 회원 정보 수정 방법으로 회사에 대하여 그 변경 사항을 알려야 합니다.</p>

                    <p>제 9조 (회원의 권리)
                    9.1 회원으로 등록하면 픽스타의 메뉴를 제약 없이 사용할 수 있습니다. (단 제 8조 1항의 경우는 예외입니다.)
                    9.2 픽스타에서 제공하는 각종 이벤트에 참가할 자격이 주어집니다.
                    9.3 회원의 탈퇴는 임의 사항이며, 탈퇴를 원하실 경우에는 블루R 웹사이트에서 계정 관리 메뉴에 접속하여 탈퇴 신청을 하실 수 있습니다.</p>

                    <p>제 10조 (회원의 의무)
                    10.1 회원의 ID와 비밀번호에 관한 모든 관리의 책임은 회원 본인에게 있습니다.
                    10.2 타인에게 피해를 주거나 미풍양속을 해치는 일체의 행위를 금합니다.
                    10.3 회원 가입 시 올바른 연락처와 E-mail 주소를 기재해 주셔야 합니다. 가입 신청서에 기재된 메일 주소가 잘못되어 반송되는 경우에는 회원 가입이 보류될 수
                    있습니다.
                    10.4 회원은 ID 및 비밀번호를 제 3자에게 이용하게 해서는 안 됩니다.
                    10.5 회원은 ID 및 비밀번호를 도난당하거나 제 3자에게 사용되고 있음을 인지한 경우에는 바로 블루R에 통보하고 별도의 지시가 있는 경우에는 그에 따라야 합니다.
                    10.6 회원은 개인정보(전화번호, 이메일 주소 등)의 변동 시 즉시 회사에 통보하여야 하며, 이와 관련된 책임은 본인에게 있습니다.
                    10.7 회원은 본 약관 및 관계 법령에서 규정한 사항을 준수할 의무가 있으며 위 사항이 지켜지지 않을 경우 회원 가입이 해지될 수 있습니다.
                    10.8 회사는 회원에게 회사의 상품에 대한 구매 비용을 전자 결제 시스템을 통해 청구할 수 있습니다.</p>

                    <p>제 11조 (회원 자격의 정지 및 상실)
                    11.1 회사는 회원이 다음 각 호에 해당되는 경우 별도의 통보 절차 없이 회원의 자격을 정지할 수 있습니다.
                    11.1.1. 회원 가입 신청이나, 회원 정보의 변경 시 허위 내용을 작성한 경우
                    11.1.2. 타인의 명의를 임의로 사용하는 경우
                    11.1.3 픽스타의 정상적인 운영을 방해하는 행위를 한 경우
                    11.1.4 픽스타를 이용하여 구입한 상품 등의 대금과 관련하여 회원이 부담하는 채무를 기일 내에 지급하지 않는 경우
                    11.1.5 픽스타에 귀속하는 저작권 등 지적재산권을 침해한 경우
                    11.1.6 픽스타의 명예를 대외적으로 훼손시켰다고 인정되는 경우
                    11.1.7 기타 픽스타가 정한 회원 가입 요건이 미비 되었을 때
                    11.2 당사는 회원의 다음 각 호에 해당되는 경우 별도의 통보 절차 없이 회원의 자격을 상실시킬 수 있습니다.
                    11.2.1 회원이 사망한 경우
                    11.2.2 픽스타에 제공되는 정보를 변경 및 수정하는 등 블루R의 운영을 고의로 방해한 경우
                    11.2.3 타인에게 피해를 주거나 기타 공공질서, 미풍양속을 현저히 저해하는 행위를 한 경우
                    11.2.4 회원 자격 정지 이후 1개월 이내에 아무런 조치를 취하지 않는 경우
                    11.2.5 본 약관에 위반한 행위를 한 경우
                    11.2.6 기타 회원으로서의 자격을 지속시키는 것이 부적절하다고 판단되는 경우</p>

                    <p>제 12조 (회원에 대한 통지)
                    12.1 회원에 대한 통지를 하는 경우에는 회원 가입 신청서에 기재된 E-Mail이나 기타의 방법으로 할 수 있습니다.
                    12.2 불특정 다수의 회원에 대한 통지는 공지사항에 공지함으로써 이를 갈음할 수 있으며, 이로 인한 불이익에 대해 당사는 책임을 지지 않습니다.</p>

                    <p>제 13조 (회원에 대한 의무)
                    13.1 픽스타는 본 약관이 정하는 바에 따라 특별한 사정이 없는 한 회원 여러분에게 안정적이고 지속적인 서비스를 제공할 수 있도록 최선의 노력을 다하겠습니다.
                    13.2 회원의 개인의 신용 정보를 포함한 개인 신상 정보를 본인의 승낙 없이 영리의 목적으로 타인에게 누설, 배포하지 않을 책임이 있습니다.
                    13.3 회원으로부터 제기되는 의견이나 불편 사항 등이 정당하다고 인정할 경우에는 즉시 처리하도록 하겠습니다. 단, 신속한 처리가 곤란한 경우에는 회원에게 그
                    사유와 처리 일정을 통보하겠습니다.
                    13.4 픽스타는 항상 회원의 신용 정보를 포함한 개인 신상 정보 보안에 대하여 관리적, 기술적 안전 조치를 강구하여 회원의 정보 보안에 최선을 다해야 할 의무가
                    있습니다.</p>

                    <p>◈ 제 3 장 ◈</p>

                    <p>기 타</p>

                    <p>제 14조 (저작권의 귀속 및 이용 제한)
                    서비스에 게재된 자료에 대한 권리는 다음 각 항과 같습니다.
                    14.1 회사가 작성한 사이트에 관한 저작권 및 기타 지적재산권은 회사에 귀속합니다.
                    14.2 게시물에 대한 권리와 책임은 게시자에게 있으며, 회사는 게시물에 대한 사용 권한을 갖습니다.
                    14.3 회원은 블루R을 이용함으로써 얻은 정보나 서비스 내에 게재된 게시물을 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리
                    목적으로 이용하거나 제 3자에게 이용하게 하여서는 안 됩니다.
                    14.4 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.</p>

                    <p>제 15조 (회원의 게시물)
                    15.1 게시물이라 함은 서비스 게시판에 회원이 올린 글과 사진, 서비스의 질문과 대답 등을 포함합니다.
                    15.2 회원이 게시하는 정보 (및 질문과 답변) 등으로 인해 발생하는 손실이나 문제는 전적으로 회원 개인의 판단에 따른 책임이며, 회사의 고의가 아닌 한,
                    회사는 이에 대하여 책임지지 않습니다.
                    15.3 회원은 공공질서나 미풍양속에 위배되는 내용과 타인의 저작권을 포함한 지적재산권 및 기타 권리를 침해하는 내용물에 대하여는 등록할 수 없으며,
                    만일 이와 같은 내용의 게시물로 인해 발생하는 결과에 대한 모든 책임은 회원 본인에게 있습니다.
                    15.4 회사는 음식점과 요리에 관한 정보 공유의 장이라는 픽스타의 운영 목적에 반한다고 판단되는 다음의 게시물이나 자료를 사전 통지 없이 삭제하거나
                    이동 또는 등록 거부를 할 수 있습니다.
                    15.4.1 다른 회원 또는 제 3자에게 심한 모욕을 주거나 명예를 손상 시키는 내용인 경우
                    15.4.2 공공질서 및 미풍양속에 위반되는 저속, 음란한 내용의 정보, 문장, 도형, 음향, 동영상을 전송, 게시하거나 링크 시키는 경우
                    15.4.3 사적인 정치적 판단이나, 종교적 견해의 내용으로 회사가 서비스 성격에 부합하지 않는다고 판단하는 경우
                    15.4.4 불법 복제 또는 해킹을 조장하는 내용인 경우
                    15.4.5 영리를 목적으로 하는 광고 등 상업적 이용이라고 판단되는 경우
                    15.4.6 범죄와 결부된다고 객관적으로 인정되는 내용일 경우
                    15.4.7 다른 이용자 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우
                    15.4.8 회사에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우
                    15.4.9 기타 관계 법령에 위배된다고 판단되는 경우
                    15.4.10 사실이 아니거나 잘못된 정보로 확인된 경우</p>

                    <p>제 16조 (대량 크롤링 및 인공 지능 학습 금지)
                    회원은 회사의 명시적인 사전 서면 허가 없이 데이터 등을 추출하기 위하여 로봇(봇), 크롤러, 스파이더, 스크레이퍼, 매크로 프로그램 또는 기타
                    자동화 수단이나 수동 프로세스를 이용하여 회사의 웹 ∙ 앱 ∙ 서버에 접근하거나 회사 서비스에 포함된 콘텐츠 및 정보를 모니터링, 복제, 수집, 확인, 정리,
                    사용하는 등의 행위를 해서는 안됩니다.
                    16.1 픽스타를 통해 제공하는 제반 콘텐츠 및 서비스와, 이외의 외부 플랫폼에 유통된 모든 콘텐츠를 대상으로 로봇, 매크로, 스파이더, 스크래퍼 등 자동화
                    도구를 활용하는 행위를 해서는 안됩니다.
                    16.2. 자동화 도구를 활용해 로그인, 콘텐츠·페이지·데이터 수집, 댓글·좋아요·제보 등 커뮤니케이션, 반복 접속 등 서비스에 과부하를 주는 행위를 해서는 안됩니다.
                    16.3. 회사가 블루R을 통해 제공하는 콘텐츠와 서비스 내용을 인공지능(AI) 모델 학습 데이터로 활용할 경우 그 활용이 공익 및 비영리 목적임을 분명히 해야 합니다.
                    학습 데이터로 활용 시 회사와 반드시 합의해야 합니다. 그렇지 않을 경우, 민형사상 책임을 물을 수 있습니다.
                    16.4. 인공 지능 및 대량 크롤링(또는 스크랩핑) 행위로 인해 데이터 소유권과 콘텐츠 및 서비스 저작권 침해가 된다고 판단되면, 회사는 형사고소, 민사 크롤링
                    금지청구,  민사 손해배상 청구 등의 조치를 취할 수 있습니다.
                    16.5. 크롤링(crawling, 또는 스크랩핑, scraping)이란 웹페이지의 내용을 그대로 가져와서 필요한 데이터를 추출해 내는 행위를 말하고, 크롤링이
                    웹페이지에 대하여 이루어지면 웹크롤링이라 부른다.</p>

                    <p>제 17조 (관할 법원)
                    본 약관과 관련한 소송은 회사의 소재지를 관할하는 법원을 관할 법원으로 합니다.</p>

                    <p>제 18조 (분쟁 해결)
                    18.1 회사는 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상 처리하기 위하여 블루R 관리담당자를 둡니다.
                    18.2 회사는 회원으로부터 제출되는 불만 사항 및 의견이 정당하다고 판단하는 경우 우선적으로 그 사항을 처리합니다. 단, 신속한 처리가 어렵다고 판단되는
                    경우에는 회원에게 그 사유와 처리 일정을 즉시 통보해 드립니다.</p>

                    <p>제 19조 (손해배상)
                    19.1 회사는 무료로 제공되는 서비스와 관련하여 회원에게 어떠한 손해가 발생하더라도 동 손해가 회사의 고의 또는 중대한 과실에 의한 경우를 제외하고
                    이에 대하여 책임을 부담하지 아니합니다.
                    19.2 회원이 이 약관의 규정을 위반하여 회사 또는 제 3자에게 손해가 발생하는 경우, 이 약관을 위반한 회원은 회사 및 제 3자에 발생한 손해를 배상할 책임이
                    있습니다.</p>

                    <p>제 20조 (면책조항)
                    회사는 픽스타 서비스 이용과 관련하여 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.</p>

                    <p>[부칙]</p>
                    <p>(시행일) 본 약관은 2023년 12월 15일부터 시행합니다.</p>
                    <p>(공고일) 2023년 12월 8일 </p>
                    <hr></hr>
            </div>
        </>
    );

}

export default UseTerms;